### 📋 Infrastructure Change Review
This PR proposes the following infrastructure changes:

```hcl
[command]/home/runner/work/_temp/15475a70-0931-41df-b8c2-7a5b59423e96/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_web_app.auth must be replaced
-/+ resource "azurerm_linux_web_app" "auth" {
      ~ app_settings                                   = {
          - "AUTH_API_PORT"                       = "8000"
          - "DB_HOST"                             = "microservice-db-server-uni29zdq.postgres.database.azure.com"
          - "DB_NAME"                             = "authdb"
          - "DB_PASSWORD"                         = (sensitive value)
          - "DB_PORT"                             = "5432"
          - "DB_USER"                             = "adminuser"
          - "JWT_SECRET"                          = "myfancysecret1234567890abcdef1234"
          - "REDIS_HOST"                          = "microservice-redis-optimized-uni29zdq.redis.cache.windows.net"
          - "REDIS_PASSWORD"                      = (sensitive value)
          - "REDIS_PORT"                          = "6379"
          - "SPRING_DATASOURCE_DRIVER_CLASS_NAME" = "org.postgresql.Driver"
          - "SPRING_DATASOURCE_PASSWORD"          = (sensitive value)
          - "SPRING_DATASOURCE_URL"               = "jdbc:postgresql://microservice-db-server-uni29zdq.postgres.database.azure.com:5432/authdb?sslmode=require"
          - "SPRING_DATASOURCE_USERNAME"          = "adminuser"
          - "SPRING_JPA_DATABASE_PLATFORM"        = "org.hibernate.dialect.PostgreSQLDialect"
          - "SPRING_JPA_HIBERNATE_DDL_AUTO"       = "update"
          - "SPRING_JPA_SHOW_SQL"                 = "false"
          - "SPRING_REDIS_HOST"                   = "microservice-redis-optimized-uni29zdq.redis.cache.windows.net"
          - "SPRING_REDIS_PASSWORD"               = (sensitive value)
          - "SPRING_REDIS_PORT"                   = "6379"
          - "SPRING_REDIS_SSL"                    = "false"
          - "USERS_API_ADDRESS"                   = "https://users-service-uni29zdq.azurewebsites.net"
          - "WEBSITES_PORT"                       = "8000"
        } -> (known after apply)
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "auth-service-uni29zdq.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/44127b49-3951-4881-8cf2-9cff7a88e6ca/resourceGroups/microservice-app-rg/providers/Microsoft.Web/sites/auth-service-uni29zdq" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "app,linux,container" -> (known after apply)
      ~ location                                       = "chilecentral" -> "centralus" # forces replacement
      ~ name                                           = "auth-service-uni29zdq" # forces replacement -> (known after apply) # forces replacement
      ~ outbound_ip_address_list                       = [
          - "68.211.56.88",
          - "68.211.56.116",
          - "68.211.56.118",
          - "68.211.56.68",
          - "68.211.56.121",
          - "68.211.56.123",
          - "68.211.56.7",
          - "68.211.56.10",
          - "68.211.56.21",
          - "68.211.56.58",
          - "68.211.56.80",
          - "68.211.56.97",
          - "68.211.9.0",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "68.211.56.88,68.211.56.116,68.211.56.118,68.211.56.68,68.211.56.121,68.211.56.123,68.211.56.7,68.211.56.10,68.211.56.21,68.211.56.58,68.211.56.80,68.211.56.97,68.211.9.0" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "68.211.56.88",
          - "68.211.56.116",
          - "68.211.56.118",
          - "68.211.56.68",
          - "68.211.56.121",
          - "68.211.56.123",
          - "68.211.56.7",
          - "68.211.56.10",
          - "68.211.56.21",
          - "68.211.56.58",
          - "68.211.56.80",
          - "68.211.56.97",
          - "68.211.56.103",
          - "68.211.56.115",
          - "68.211.56.192",
          - "68.211.56.196",
          - "68.211.56.198",
          - "68.211.56.228",
          - "68.211.56.239",
          - "68.211.56.241",
          - "68.211.56.242",
          - "68.211.56.246",
          - "68.211.56.248",
          - "68.211.56.252",
          - "68.211.56.99",
          - "68.211.56.125",
          - "68.211.56.127",
          - "68.211.56.209",
          - "68.211.56.210",
          - "68.211.56.213",
          - "68.211.9.0",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "68.211.56.88,68.211.56.116,68.211.56.118,68.211.56.68,68.211.56.121,68.211.56.123,68.211.56.7,68.211.56.10,68.211.56.21,68.211.56.58,68.211.56.80,68.211.56.97,68.211.56.103,68.211.56.115,68.211.56.192,68.211.56.196,68.211.56.198,68.211.56.228,68.211.56.239,68.211.56.241,68.211.56.242,68.211.56.246,68.211.56.248,68.211.56.252,68.211.56.99,68.211.56.125,68.211.56.127,68.211.56.209,68.211.56.210,68.211.56.213,68.211.9.0" -> (known after apply)
      ~ service_plan_id                                = "/subscriptions/44127b49-3951-4881-8cf2-9cff7a88e6ca/resourceGroups/microservice-app-rg/providers/Microsoft.Web/serverFarms/microservice-plan-uni29zdq" -> (known after apply)
      ~ site_credential                                = (sensitive value)
      - tags                                           = {} -> null
      + zip_deploy_file                                = (known after apply)
        # (9 unchanged attributes hidden)

      ~ site_config {
          - auto_heal_enabled                       = false -> null
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
              - "hostingstart.html",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = false -> (known after apply)
          ~ health_check_eviction_time_in_min       = 0 -> (known after apply)
          ~ linux_fx_version                        = "DOCKER|index.docker.io/osgomez/auth-service:latest" -> (known after apply)
          ~ remote_debugging_version                = "VS2022" -> (known after apply)
          ~ scm_type                                = "None" -> (known after apply)
          ~ worker_count                            = 1 -> (known after apply)
            # (16 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_web_app.frontend must be replaced
-/+ resource "azurerm_linux_web_app" "frontend" {
      ~ app_settings                                   = {
          - "AUTH_API_ADDRESS"  = "https://auth-service-uni29zdq.azurewebsites.net"
          - "JWT_SECRET"        = "myfancysecret1234567890abcdef1234"
          - "TODOS_API_ADDRESS" = "https://todos-service-uni29zdq.azurewebsites.net"
          - "WEBSITES_PORT"     = "80"
        } -> (known after apply)
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "frontend-service-uni29zdq.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/44127b49-3951-4881-8cf2-9cff7a88e6ca/resourceGroups/microservice-app-rg/providers/Microsoft.Web/sites/frontend-service-uni29zdq" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "app,linux,container" -> (known after apply)
      ~ location                                       = "chilecentral" -> "centralus" # forces replacement
      ~ name                                           = "frontend-service-uni29zdq" # forces replacement -> (known after apply) # forces replacement
      ~ outbound_ip_address_list                       = [
          - "68.211.56.88",
          - "68.211.56.116",
          - "68.211.56.118",
          - "68.211.56.68",
          - "68.211.56.121",
          - "68.211.56.123",
          - "68.211.56.7",
          - "68.211.56.10",
          - "68.211.56.21",
          - "68.211.56.58",
          - "68.211.56.80",
          - "68.211.56.97",
          - "68.211.9.0",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "68.211.56.88,68.211.56.116,68.211.56.118,68.211.56.68,68.211.56.121,68.211.56.123,68.211.56.7,68.211.56.10,68.211.56.21,68.211.56.58,68.211.56.80,68.211.56.97,68.211.9.0" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "68.211.56.88",
          - "68.211.56.116",
          - "68.211.56.118",
          - "68.211.56.68",
          - "68.211.56.121",
          - "68.211.56.123",
          - "68.211.56.7",
          - "68.211.56.10",
          - "68.211.56.21",
          - "68.211.56.58",
          - "68.211.56.80",
          - "68.211.56.97",
          - "68.211.56.103",
          - "68.211.56.115",
          - "68.211.56.192",
          - "68.211.56.196",
          - "68.211.56.198",
          - "68.211.56.228",
          - "68.211.56.239",
          - "68.211.56.241",
          - "68.211.56.242",
          - "68.211.56.246",
          - "68.211.56.248",
          - "68.211.56.252",
          - "68.211.56.99",
          - "68.211.56.125",
          - "68.211.56.127",
          - "68.211.56.209",
          - "68.211.56.210",
          - "68.211.56.213",
          - "68.211.9.0",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "68.211.56.88,68.211.56.116,68.211.56.118,68.211.56.68,68.211.56.121,68.211.56.123,68.211.56.7,68.211.56.10,68.211.56.21,68.211.56.58,68.211.56.80,68.211.56.97,68.211.56.103,68.211.56.115,68.211.56.192,68.211.56.196,68.211.56.198,68.211.56.228,68.211.56.239,68.211.56.241,68.211.56.242,68.211.56.246,68.211.56.248,68.211.56.252,68.211.56.99,68.211.56.125,68.211.56.127,68.211.56.209,68.211.56.210,68.211.56.213,68.211.9.0" -> (known after apply)
      ~ service_plan_id                                = "/subscriptions/44127b49-3951-4881-8cf2-9cff7a88e6ca/resourceGroups/microservice-app-rg/providers/Microsoft.Web/serverFarms/microservice-plan-uni29zdq" -> (known after apply)
      ~ site_credential                                = (sensitive value)
      - tags                                           = {} -> null
      + zip_deploy_file                                = (known after apply)
        # (9 unchanged attributes hidden)

      ~ site_config {
          - auto_heal_enabled                       = false -> null
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
              - "hostingstart.html",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = false -> (known after apply)
          ~ health_check_eviction_time_in_min       = 0 -> (known after apply)
          ~ linux_fx_version                        = "DOCKER|index.docker.io/osgomez/frontend:latest" -> (known after apply)
          ~ remote_debugging_version                = "VS2022" -> (known after apply)
          ~ scm_type                                = "None" -> (known after apply)
          ~ worker_count                            = 1 -> (known after apply)
            # (16 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_web_app.log_processor must be replaced
-/+ resource "azurerm_linux_web_app" "log_processor" {
      ~ app_settings                                   = {
          - "LOG_LEVEL"      = "INFO"
          - "REDIS_CHANNEL"  = "log_channel"
          - "REDIS_HOST"     = "microservice-redis-optimized-uni29zdq.redis.cache.windows.net"
          - "REDIS_PASSWORD" = "IkAtxw8GHDDGkmbvRIzqPM55SHLqfWFI1AzCaFi1Keo="
          - "REDIS_PORT"     = "6379"
        } -> (known after apply)
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "log-processor-service-uni29zdq.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/44127b49-3951-4881-8cf2-9cff7a88e6ca/resourceGroups/microservice-app-rg/providers/Microsoft.Web/sites/log-processor-service-uni29zdq" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "app,linux,container" -> (known after apply)
      ~ location                                       = "chilecentral" -> "centralus" # forces replacement
      ~ name                                           = "log-processor-service-uni29zdq" # forces replacement -> (known after apply) # forces replacement
      ~ outbound_ip_address_list                       = [
          - "68.211.56.88",
          - "68.211.56.116",
          - "68.211.56.118",
          - "68.211.56.68",
          - "68.211.56.121",
          - "68.211.56.123",
          - "68.211.56.7",
          - "68.211.56.10",
          - "68.211.56.21",
          - "68.211.56.58",
          - "68.211.56.80",
          - "68.211.56.97",
          - "68.211.9.0",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "68.211.56.88,68.211.56.116,68.211.56.118,68.211.56.68,68.211.56.121,68.211.56.123,68.211.56.7,68.211.56.10,68.211.56.21,68.211.56.58,68.211.56.80,68.211.56.97,68.211.9.0" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "68.211.56.88",
          - "68.211.56.116",
          - "68.211.56.118",
          - "68.211.56.68",
          - "68.211.56.121",
          - "68.211.56.123",
          - "68.211.56.7",
          - "68.211.56.10",
          - "68.211.56.21",
          - "68.211.56.58",
          - "68.211.56.80",
          - "68.211.56.97",
          - "68.211.56.103",
          - "68.211.56.115",
          - "68.211.56.192",
          - "68.211.56.196",
          - "68.211.56.198",
          - "68.211.56.228",
          - "68.211.56.239",
          - "68.211.56.241",
          - "68.211.56.242",
          - "68.211.56.246",
          - "68.211.56.248",
          - "68.211.56.252",
          - "68.211.56.99",
          - "68.211.56.125",
          - "68.211.56.127",
          - "68.211.56.209",
          - "68.211.56.210",
          - "68.211.56.213",
          - "68.211.9.0",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "68.211.56.88,68.211.56.116,68.211.56.118,68.211.56.68,68.211.56.121,68.211.56.123,68.211.56.7,68.211.56.10,68.211.56.21,68.211.56.58,68.211.56.80,68.211.56.97,68.211.56.103,68.211.56.115,68.211.56.192,68.211.56.196,68.211.56.198,68.211.56.228,68.211.56.239,68.211.56.241,68.211.56.242,68.211.56.246,68.211.56.248,68.211.56.252,68.211.56.99,68.211.56.125,68.211.56.127,68.211.56.209,68.211.56.210,68.211.56.213,68.211.9.0" -> (known after apply)
      ~ service_plan_id                                = "/subscriptions/44127b49-3951-4881-8cf2-9cff7a88e6ca/resourceGroups/microservice-app-rg/providers/Microsoft.Web/serverFarms/microservice-plan-uni29zdq" -> (known after apply)
      ~ site_credential                                = (sensitive value)
      - tags                                           = {} -> null
      + zip_deploy_file                                = (known after apply)
        # (9 unchanged attributes hidden)

      ~ site_config {
          - auto_heal_enabled                       = false -> null
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
              - "hostingstart.html",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = false -> (known after apply)
          ~ health_check_eviction_time_in_min       = 0 -> (known after apply)
          ~ linux_fx_version                        = "DOCKER|index.docker.io/osgomez/log-message-processor:latest" -> (known after apply)
          ~ remote_debugging_version                = "VS2022" -> (known after apply)
          ~ scm_type                                = "None" -> (known after apply)
          ~ worker_count                            = 1 -> (known after apply)
            # (16 unchanged attributes hidden)

          ~ application_stack {
              # Warning: this attribute value will be marked as sensitive and will not
              # display in UI output after applying this change. The value is unchanged.
              ~ docker_registry_username = (sensitive value)
                # (3 unchanged attributes hidden)
            }
        }
    }

  # azurerm_linux_web_app.todos must be replaced
-/+ resource "azurerm_linux_web_app" "todos" {
      ~ app_settings                                   = {
          - "DB_HOST"                             = "microservice-db-server-uni29zdq.postgres.database.azure.com"
          - "DB_NAME"                             = "todosdb"
          - "DB_PASSWORD"                         = (sensitive value)
          - "DB_PORT"                             = "5432"
          - "DB_USER"                             = "adminuser"
          - "JWT_SECRET"                          = "myfancysecret1234567890abcdef1234"
          - "REDIS_CHANNEL"                       = "log_channel"
          - "REDIS_HOST"                          = "microservice-redis-optimized-uni29zdq.redis.cache.windows.net"
          - "REDIS_PASSWORD"                      = (sensitive value)
          - "REDIS_PORT"                          = "6379"
          - "SPRING_DATASOURCE_DRIVER_CLASS_NAME" = "org.postgresql.Driver"
          - "SPRING_DATASOURCE_PASSWORD"          = (sensitive value)
          - "SPRING_DATASOURCE_URL"               = "jdbc:postgresql://microservice-db-server-uni29zdq.postgres.database.azure.com:5432/todosdb?sslmode=require"
          - "SPRING_DATASOURCE_USERNAME"          = "adminuser"
          - "SPRING_JPA_DATABASE_PLATFORM"        = "org.hibernate.dialect.PostgreSQLDialect"
          - "SPRING_JPA_HIBERNATE_DDL_AUTO"       = "update"
          - "SPRING_JPA_SHOW_SQL"                 = "false"
          - "SPRING_REDIS_HOST"                   = "microservice-redis-optimized-uni29zdq.redis.cache.windows.net"
          - "SPRING_REDIS_PASSWORD"               = (sensitive value)
          - "SPRING_REDIS_PORT"                   = "6379"
          - "SPRING_REDIS_SSL"                    = "false"
          - "TODOS_API_PORT"                      = "8082"
          - "WEBSITES_PORT"                       = "8082"
        } -> (known after apply)
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "todos-
... (truncated for readability)
```

> **Security Note**: All changes have been scanned for security vulnerabilities using Checkov and Trivy.